app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC
---
  def index
    articles = Article.order('created_at DESC')

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    begin
      article = Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."title" = $1 LIMIT $2  [["title", "this is the test title"], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    if !article_params.nil?
      if (Article.find_by title: article_params[:title]).nil?
      article = Article.new(article_params)
      response = if article.save